import json
import sys

# python scripts/extract_math_topic.py > math_topic_jp.jsonl

# Convert this to markdown table. Then extract all of the items as a Python list.
#
# ```
# (copy and paste the content of page 15 of https://www.mext.go.jp/content/20230217-mxt_kyoiku02-100002620_05.pdf)
# ```

math_topics_1_2_3 = [
    "数と式",
    "数と集合",
    "簡単な無理数の計算",
    "集合と命題",
    # "式",
    "式の展開と因数分解",
    "一次不等式",

    "図形と計量",
    "三角比",
    "鋭角の三角比",
    "鈍角の三角比",
    "正弦定理",
    "余弦定理",
    "図形の計量",

    "二次関数",
    "二次関数とそのグラフ",
    "二次関数の値の変化",
    "二次関数の最大",
    "二次関数の最小",
    "二次関数と二次方程式",
    "二次関数と二次不等式",

    "データの分析",
    "データの散らばり",
    "分散",
    "標準偏差",
    "データの相関",
    "散布図",
    "相関係数",
    "仮説検定の考え方",

    "いろいろな式",
    # "式"
    "多項式の乗法",
    "多項式の除法",
    "分数式",
    "二項定理",
    "等式と不等式の証明",
    # "高次方程式など",
    "複素数と二次方程式",
    "高次方程式",

    "図形と方程式",
    "直線と円",
    "点と直線",
    "円の方程式",
    "軌跡と領域",

    "指数関数・対数関数",
    "指数関数",
    "指数の拡張",
    "指数関数",
    "対数関数",
    "対数",
    "対数関数",

    "三角関数",
    "角の拡張",
    "三角関数",
    "三角関数",
    "三角関数の基本的な性質",
    "三角関数の加法定理",
    "２倍角の公式",
    "三角関数の合成",

    "微分・積分の考え",
    "微分の考え",
    "微分係数と導関数",
    "関数の定数倍",
    "関数の和の導関数",
    "関数の差の導関数",
    "導関数の応用",
    "積分の考え",
    "不定積分と定積分",
    "面積",

    "極限",
    "数列の極限",
    "数列 {r^n} の極限",
    "無限等比級数の和",
    "関数とその極限",
    "分数関数と無理関数",
    "合成関数と逆関数",
    "関数の値の極限",

    "微分法",
    "導関数",
    "関数の和の導関数",
    "関数の差の導関数",
    "関数の積の導関数",
    "関数の商の導関数",
    "合成関数の導関数",
    "三角関数の導関数",
    "指数関数の導関数",
    "対数関数の導関数",
    "導関数の応用",
    "接線",
    "関数の値の増減",
    "極大・極小",
    "グラフの凹凸",
    "速度・加速度",

    "積分法",
    "不定積分と定積分",
    "積分とその基本的な性質",
    "置換積分法",
    "部分積分法",
    "いろいろな関数の積分",
    "積分の応用",
    "面積",
    "体積",
    "曲線の長さ",
]

# Convert this to markdown table. Then extract all of the items as a Python list.
#
# ```
# (copy and paste the content of page 16 of https://www.mext.go.jp/content/20230217-mxt_kyoiku02-100002620_05.pdf)
# ```

math_topics_a_b_c = [
    "図形の性質",
    "平面図形",
    "三角形の性質",
    "円の性質",
    "平面図形の作図",
    "空間図形",

    "場合の数と確率",
    "場合の数",
    "数え上げの原則",
    "順列・組合せ",
    "確率",
    "確率とその基本的な法則",
    "確率の余事象",
    "確率の排反",
    "確率の期待値",
    "独立な試行と確率",
    "条件付き確率",

    "数学と人間の活動",
    "数量や図形と人間の活動",
    "遊びの中の数学",
    "ユークリッドの互除法",
    "二進法",
    "平面や空間における点の位置",

    "数列",
    "数列とその和",
    "等差数列と等比数列",
    "いろいろな数列",
    "漸化式と数学的帰納法",
    "漸化式と数列",
    "数学的帰納法",

    "統計的な推測",
    "確率分布",
    "確率変数と確率分布",
    "確率変数の平均",
    "確率変数の分散",
    "確率変数の標準偏差",
    "二項分布",
    "正規分布",
    "連続型確率変数",
    "正規分布",
    "統計的な推測",
    "母集団と標本",
    "統計的な推測の考え",
    "区間推定",
    "仮説検定",

    "数学と社会生活",
    "数理的な問題解決",

    "ベクトル",
    "平面上のベクトル",
    "ベクトルとその演算",
    "ベクトルの内積",
    "空間座標とベクトル",
    "空間座標",
    "空間におけるベクトル",

    "平面上の曲線と複素数平面",
    "平面上の曲線",
    "二次曲線",
    "曲線の直交座標による表示",
    "曲線の媒介変数による表示",
    "曲線の極座標による表示",
    "複素数平面",
    "ド・モアブルの定理",

    "数学的な表現の工夫",
    "数学的な表現の意義やよさ",
    # "図",
    # "表",
    "統計グラフ",
    "離散グラフ",
    "行列",
]

print(f"length of math_topics_1_2_3: {len(math_topics_1_2_3)}", file=sys.stderr)
print(f"length of math_topics_a_b_c: {len(math_topics_a_b_c)}", file=sys.stderr)

# Merge the three lists
math_topics = list(set(math_topics_1_2_3) | set(math_topics_a_b_c))
print(f"length of math_topics: {len(math_topics)}", file=sys.stderr)

# Sort the merged list
math_topics = sorted(math_topics)

# Save the merged list to a file
for topic in math_topics:
    print(json.dumps({"topic": topic}, ensure_ascii=False))

# print(math_topics)
